hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
#define	JPEG_QMEM3_7_QCOEF31			(0xFFu<<24)
#define	JPEG_QMEM3_7_QCOEF31_0			(0x1u<<24)
#define	JPEG_QMEM3_7_QCOEF30			(0xFFu<<16)
#define	JPEG_QMEM3_7_QCOEF30_0			(0x1u<<16)
#define	JPEG_QMEM3_7_QCOEF29			(0xFFu<<8)
#define	JPEG_QMEM3_7_QCOEF29_0			(0x1u<<8)
#define	JPEG_QMEM3_7_QCOEF28			(0xFFu<<0)
#define	JPEG_QMEM3_7_QCOEF28_0			(0x1u<<0)

// QMEM3_8 Configuration

#define	JPEG_QMEM3_8_QCOEF35			(0xFFu<<24)
#define	JPEG_QMEM3_8_QCOEF35_0			(0x1u<<24)
#define	JPEG_QMEM3_8_QCOEF34			(0xFFu<<16)
#define	JPEG_QMEM3_8_QCOEF34_0			(0x1u<<16)
#define	JPEG_QMEM3_8_QCOEF33			(0xFFu<<8)
#define	JPEG_QMEM3_8_QCOEF33_0			(0x1u<<8)
#define	JPEG_QMEM3_8_QCOEF32			(0xFFu<<0)
#define	JPEG_QMEM3_8_QCOEF32_0			(0x1u<<0)

// QMEM3_9 Configuration

#define	JPEG_QMEM3_9_QCOEF39			(0xFFu<<24)
#define	JPEG_QMEM3_9_QCOEF39_0			(0x1u<<24)
#define	JPEG_QMEM3_9_QCOEF38			(0xFFu<<16)
#define	JPEG_QMEM3_9_QCOEF38_0			(0x1u<<16)
#define	JPEG_QMEM3_9_QCOEF37			(0xFFu<<8)
#define	JPEG_QMEM3_9_QCOEF37_0			(0x1u<<8)
#define	JPEG_QMEM3_9_QCOEF36			(0xFFu<<0)
#define	JPEG_QMEM3_9_QCOEF36_0			(0x1u<<0)

// QMEM3_10 Configuration

#define	JPEG_QMEM3_10_QCOEF43			(0xFFu<<24)
#define	JPEG_QMEM3_10_QCOEF43_0			(0x1u<<24)
#define	JPEG_QMEM3_10_QCOEF42			(0xFFu<<16)
#define	JPEG_QMEM3_10_QCOEF42_0			(0x1u<<16)
#define	JPEG_QMEM3_10_QCOEF41			(0xFFu<<8)
#define	JPEG_QMEM3_10_QCOEF41_0			(0x1u<<8)
#define	JPEG_QMEM3_10_QCOEF40			(0xFFu<<0)
#define	JPEG_QMEM3_10_QCOEF40_0			(0x1u<<0)

// QMEM3_11 Configuration

#define	JPEG_QMEM3_11_QCOEF47			(0xFFu<<24)
#define	JPEG_QMEM3_11_QCOEF47_0			(0x1u<<24)
#define	JPEG_QMEM3_11_QCOEF46			(0xFFu<<16)
#define	JPEG_QMEM3_11_QCOEF46_0			(0x1u<<16)
#define	JPEG_QMEM3_11_QCOEF45			(0xFFu<<8)
#define	JPEG_QMEM3_11_QCOEF45_0			(0x1u<<8)
#define	JPEG_QMEM3_11_QCOEF44			(0xFFu<<0)
#define	JPEG_QMEM3_11_QCOEF44_0			(0x1u<<0)

// QMEM3_12 Configuration

#define	JPEG_QMEM3_12_QCOEF51			(0xFFu<<24)
#define	JPEG_QMEM3_12_QCOEF51_0			(0x1u<<24)
#define	JPEG_QMEM3_12_QCOEF50			(0xFFu<<16)
#define	JPEG_QMEM3_12_QCOEF50_0			(0x1u<<16)
#define	JPEG_QMEM3_12_QCOEF49			(0xFFu<<8)
#define	JPEG_QMEM3_12_QCOEF49_0			(0x1u<<8)
#define	JPEG_QMEM3_12_QCOEF48			(0xFFu<<0)
#define	JPEG_QMEM3_12_QCOEF48_0			(0x1u<<0)

// QMEM3_13 Configuration

#define	JPEG_QMEM3_13_QCOEF55			(0xFFu<<24)
#define	JPEG_QMEM3_13_QCOEF55_0			(0x1u<<24)
#define	JPEG_QMEM3_13_QCOEF54			(0xFFu<<16)
#define	JPEG_QMEM3_13_QCOEF54_0			(0x1u<<16)
#define	JPEG_QMEM3_13_QCOEF53			(0xFFu<<8)
#define	JPEG_QMEM3_13_QCOEF53_0			(0x1u<<8)
#define	JPEG_QMEM3_13_QCOEF52			(0xFFu<<0)
#define	JPEG_QMEM3_13_QCOEF52_0			(0x1u<<0)

// QMEM3_14 Configuration

#define	JPEG_QMEM3_14_QCOEF59			(0xFFu<<24)
#define	JPEG_QMEM3_14_QCOEF59_0			(0x1u<<24)
#define	JPEG_QMEM3_14_QCOEF58			(0xFFu<<16)
#define	JPEG_QMEM3_14_QCOEF58_0			(0x1u<<16)
#define	JPEG_QMEM3_14_QCOEF57			(0xFFu<<8)
#define	JPEG_QMEM3_14_QCOEF57_0			(0x1u<<8)
#define	JPEG_QMEM3_14_QCOEF56			(0xFFu<<0)
#define	JPEG_QMEM3_14_QCOEF56_0			(0x1u<<0)

// QMEM3_15 Configuration

#define	JPEG_QMEM3_15_QCOEF63			(0xFFu<<24)
#define	JPEG_QMEM3_15_QCOEF63_0			(0x1u<<24)
#define	JPEG_QMEM3_15_QCOEF62			(0xFFu<<16)
#define	JPEG_QMEM3_15_QCOEF62_0			(0x1u<<16)
#define	JPEG_QMEM3_15_QCOEF61			(0xFFu<<8)
#define	JPEG_QMEM3_15_QCOEF61_0			(0x1u<<8)
#define	JPEG_QMEM3_15_QCOEF60			(0xFFu<<0)
#define	JPEG_QMEM3_15_QCOEF60_0			(0x1u<<0)

// HUFFMIN0_0 Configuration

#define	JPEG_HUFFMIN0_0_DATA0			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN0_0_DATA0_0			(0x1u<<0)

// HUFFMIN0_1 Configuration

#define	JPEG_HUFFMIN0_1_DATA0			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN0_1_DATA0_0			(0x1u<<0)

// HUFFMIN0_2 Configuration

#define	JPEG_HUFFMIN0_2_DATA0			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN0_2_DATA0_0			(0x1u<<0)

// HUFFMIN0_3 Configuration

#define	JPEG_HUFFMIN0_3_DATA0			(0xFu<<0)
#define	JPEG_HUFFMIN0_3_DATA0_0			(0x1u<<0)

// HUFFMIN1_0 Configuration

#define	JPEG_HUFFMIN1_0_DATA1			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN1_0_DATA1_0			(0x1u<<0)

// HUFFMIN1_1 Configuration

#define	JPEG_HUFFMIN1_1_DATA1			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN1_1_DATA1_0			(0x1u<<0)

// HUFFMIN1_2 Configuration

#define	JPEG_HUFFMIN1_2_DATA1			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN1_2_DATA1_0			(0x1u<<0)

// HUFFMIN1_3 Configuration

#define	JPEG_HUFFMIN1_3_DATA1			(0xFu<<0)
#define	JPEG_HUFFMIN1_3_DATA1_0			(0x1u<<0)

// HUFFMIN2_0 Configuration

#define	JPEG_HUFFMIN2_0_DATA2			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN2_0_DATA2_0			(0x1u<<0)

// HUFFMIN2_1 Configuration

#define	JPEG_HUFFMIN2_1_DATA2			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN2_1_DATA2_0			(0x1u<<0)

// HUFFMIN2_2 Configuration

#define	JPEG_HUFFMIN2_2_DATA2			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN2_2_DATA2_0			(0x1u<<0)

// HUFFMIN2_3 Configuration

#define	JPEG_HUFFMIN2_3_DATA2			(0xFu<<0)
#define	JPEG_HUFFMIN2_3_DATA2_0			(0x1u<<0)

// HUFFMIN3_0 Configuration

#define	JPEG_HUFFMIN3_0_DATA3			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN3_0_DATA3_0			(0x1u<<0)

// HUFFMIN3_1 Configuration

#define	JPEG_HUFFMIN3_1_DATA3			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN3_1_DATA3_0			(0x1u<<0)

// HUFFMIN3_2 Configuration

#define	JPEG_HUFFMIN3_2_DATA3			(0xFFFFFFFFu<<0)
#define	JPEG_HUFFMIN3_2_DATA3_0			(0x1u<<0)

// HUFFMIN3_3 Configuration

#define	JPEG_HUFFMIN3_3_DATA3			(0xFu<<0)
#define	JPEG_HUFFMIN3_3_DATA3_0			(0x1u<<0)

// HUFFBASE0 Configuration

#define	JPEG_HUFFBASE0_DATA1			(0x1FFu<<16)
#define	JPEG_HUFFBASE0_DATA1_0			(0x1u<<16)
#define	JPEG_HUFFBASE0_DATA0			(0x1FFu<<0)
#define	JPEG_HUFFBASE0_DATA0_0			(0x1u<<0)

// HUFFBASE1 Configuration

#define	JPEG_HUFFBASE1_DATA3			(0x1FFu<<16)
#define	JPEG_HUFFBASE1_DATA3_0			(0x1u<<16)
#define	JPEG_HUFFBASE1_DATA2			(0x1FFu<<0)
#define	JPEG_HUFFBASE1_DATA2_0			(0x1u<<0)

// HUFFBASE2 Configuration

#define	JPEG_HUFFBASE2_DATA5			(0x1FFu<<16)
#define	JPEG_HUFFBASE2_DATA5_0			(0x1u<<16)
#define	JPEG_HUFFBASE2_DATA4			(0x1FFu<<0)
#define	JPEG_HUFFBASE2_DATA4_0			(0x1u<<0)

// HUFFBASE3 Configuration

#define	JPEG_HUFFBASE3_DATA7			(0x1FFu<<16)
#define	JPEG_HUFFBASE3_DATA7_0			(0x1u<<16)
#define	JPEG_HUFFBASE3_DATA6			(0x1FFu<<0)
#define	JPEG_HUFFBASE3_DATA6_0			(0x1u<<0)

// HUFFBASE4 Configuration

