hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
#define	JPEG_HUFFBASE4_DATA9			(0x1FFu<<16)
#define	JPEG_HUFFBASE4_DATA9_0			(0x1u<<16)
#define	JPEG_HUFFBASE4_DATA8			(0x1FFu<<0)
#define	JPEG_HUFFBASE4_DATA8_0			(0x1u<<0)

// HUFFBASE5 Configuration

#define	JPEG_HUFFBASE5_DATA11			(0x1FFu<<16)
#define	JPEG_HUFFBASE5_DATA11_0			(0x1u<<16)
#define	JPEG_HUFFBASE5_DATA10			(0x1FFu<<0)
#define	JPEG_HUFFBASE5_DATA10_0			(0x1u<<0)

// HUFFBASE6 Configuration

#define	JPEG_HUFFBASE6_DATA13			(0x1FFu<<16)
#define	JPEG_HUFFBASE6_DATA13_0			(0x1u<<16)
#define	JPEG_HUFFBASE6_DATA12			(0x1FFu<<0)
#define	JPEG_HUFFBASE6_DATA12_0			(0x1u<<0)

// HUFFBASE7 Configuration

#define	JPEG_HUFFBASE7_DATA15			(0x1FFu<<16)
#define	JPEG_HUFFBASE7_DATA15_0			(0x1u<<16)
#define	JPEG_HUFFBASE7_DATA14			(0x1FFu<<0)
#define	JPEG_HUFFBASE7_DATA14_0			(0x1u<<0)

// HUFFBASE8 Configuration

#define	JPEG_HUFFBASE8_DATA17			(0x1FFu<<16)
#define	JPEG_HUFFBASE8_DATA17_0			(0x1u<<16)
#define	JPEG_HUFFBASE8_DATA16			(0x1FFu<<0)
#define	JPEG_HUFFBASE8_DATA16_0			(0x1u<<0)

// HUFFBASE9 Configuration

#define	JPEG_HUFFBASE9_DATA19			(0x1FFu<<16)
#define	JPEG_HUFFBASE9_DATA19_0			(0x1u<<16)
#define	JPEG_HUFFBASE9_DATA18			(0x1FFu<<0)
#define	JPEG_HUFFBASE9_DATA18_0			(0x1u<<0)

// HUFFBASE10 Configuration

#define	JPEG_HUFFBASE10_DATA21			(0x1FFu<<16)
#define	JPEG_HUFFBASE10_DATA21_0		(0x1u<<16)
#define	JPEG_HUFFBASE10_DATA20			(0x1FFu<<0)
#define	JPEG_HUFFBASE10_DATA20_0		(0x1u<<0)

// HUFFBASE11 Configuration

#define	JPEG_HUFFBASE11_DATA23			(0x1FFu<<16)
#define	JPEG_HUFFBASE11_DATA23_0		(0x1u<<16)
#define	JPEG_HUFFBASE11_DATA22			(0x1FFu<<0)
#define	JPEG_HUFFBASE11_DATA22_0		(0x1u<<0)

// HUFFBASE12 Configuration

#define	JPEG_HUFFBASE12_DATA25			(0x1FFu<<16)
#define	JPEG_HUFFBASE12_DATA25_0		(0x1u<<16)
#define	JPEG_HUFFBASE12_DATA24			(0x1FFu<<0)
#define	JPEG_HUFFBASE12_DATA24_0		(0x1u<<0)

// HUFFBASE13 Configuration

#define	JPEG_HUFFBASE13_DATA27			(0x1FFu<<16)
#define	JPEG_HUFFBASE13_DATA27_0		(0x1u<<16)
#define	JPEG_HUFFBASE13_DATA26			(0x1FFu<<0)
#define	JPEG_HUFFBASE13_DATA26_0		(0x1u<<0)

// HUFFBASE14 Configuration

#define	JPEG_HUFFBASE14_DATA29			(0x1FFu<<16)
#define	JPEG_HUFFBASE14_DATA29_0		(0x1u<<16)
#define	JPEG_HUFFBASE14_DATA28			(0x1FFu<<0)
#define	JPEG_HUFFBASE14_DATA28_0		(0x1u<<0)

// HUFFBASE15 Configuration

#define	JPEG_HUFFBASE15_DATA31			(0x1FFu<<16)
#define	JPEG_HUFFBASE15_DATA31_0		(0x1u<<16)
#define	JPEG_HUFFBASE15_DATA30			(0x1FFu<<0)
#define	JPEG_HUFFBASE15_DATA30_0		(0x1u<<0)

// HUFFBASE16 Configuration

#define	JPEG_HUFFBASE16_DATA33			(0x1FFu<<16)
#define	JPEG_HUFFBASE16_DATA33_0		(0x1u<<16)
#define	JPEG_HUFFBASE16_DATA32			(0x1FFu<<0)
#define	JPEG_HUFFBASE16_DATA32_0		(0x1u<<0)

// HUFFBASE17 Configuration

#define	JPEG_HUFFBASE17_DATA35			(0x1FFu<<16)
#define	JPEG_HUFFBASE17_DATA35_0		(0x1u<<16)
#define	JPEG_HUFFBASE17_DATA34			(0x1FFu<<0)
#define	JPEG_HUFFBASE17_DATA34_0		(0x1u<<0)

// HUFFBASE18 Configuration

#define	JPEG_HUFFBASE18_DATA37			(0x1FFu<<16)
#define	JPEG_HUFFBASE18_DATA37_0		(0x1u<<16)
#define	JPEG_HUFFBASE18_DATA36			(0x1FFu<<0)
#define	JPEG_HUFFBASE18_DATA36_0		(0x1u<<0)

// HUFFBASE19 Configuration

#define	JPEG_HUFFBASE19_DATA39			(0x1FFu<<16)
#define	JPEG_HUFFBASE19_DATA39_0		(0x1u<<16)
#define	JPEG_HUFFBASE19_DATA38			(0x1FFu<<0)
#define	JPEG_HUFFBASE19_DATA38_0		(0x1u<<0)

// HUFFBASE20 Configuration

#define	JPEG_HUFFBASE20_DATA41			(0x1FFu<<16)
#define	JPEG_HUFFBASE20_DATA41_0		(0x1u<<16)
#define	JPEG_HUFFBASE20_DATA40			(0x1FFu<<0)
#define	JPEG_HUFFBASE20_DATA40_0		(0x1u<<0)

// HUFFBASE21 Configuration

#define	JPEG_HUFFBASE21_DATA43			(0x1FFu<<16)
#define	JPEG_HUFFBASE21_DATA43_0		(0x1u<<16)
#define	JPEG_HUFFBASE21_DATA42			(0x1FFu<<0)
#define	JPEG_HUFFBASE21_DATA42_0		(0x1u<<0)

// HUFFBASE22 Configuration

#define	JPEG_HUFFBASE22_DATA45			(0x1FFu<<16)
#define	JPEG_HUFFBASE22_DATA45_0		(0x1u<<16)
#define	JPEG_HUFFBASE22_DATA44			(0x1FFu<<0)
#define	JPEG_HUFFBASE22_DATA44_0		(0x1u<<0)

// HUFFBASE23 Configuration

#define	JPEG_HUFFBASE23_DATA47			(0x1FFu<<16)
#define	JPEG_HUFFBASE23_DATA47_0		(0x1u<<16)
#define	JPEG_HUFFBASE23_DATA46			(0x1FFu<<0)
#define	JPEG_HUFFBASE23_DATA46_0		(0x1u<<0)

// HUFFBASE24 Configuration

#define	JPEG_HUFFBASE24_DATA49			(0x1FFu<<16)
#define	JPEG_HUFFBASE24_DATA49_0		(0x1u<<16)
#define	JPEG_HUFFBASE24_DATA48			(0x1FFu<<0)
#define	JPEG_HUFFBASE24_DATA48_0		(0x1u<<0)

// HUFFBASE25 Configuration

#define	JPEG_HUFFBASE25_DATA51			(0x1FFu<<16)
#define	JPEG_HUFFBASE25_DATA51_0		(0x1u<<16)
#define	JPEG_HUFFBASE25_DATA50			(0x1FFu<<0)
#define	JPEG_HUFFBASE25_DATA50_0		(0x1u<<0)

// HUFFBASE26 Configuration

#define	JPEG_HUFFBASE26_DATA53			(0x1FFu<<16)
#define	JPEG_HUFFBASE26_DATA53_0		(0x1u<<16)
#define	JPEG_HUFFBASE26_DATA52			(0x1FFu<<0)
#define	JPEG_HUFFBASE26_DATA52_0		(0x1u<<0)

// HUFFBASE27 Configuration

#define	JPEG_HUFFBASE27_DATA55			(0x1FFu<<16)
#define	JPEG_HUFFBASE27_DATA55_0		(0x1u<<16)
#define	JPEG_HUFFBASE27_DATA54			(0x1FFu<<0)
#define	JPEG_HUFFBASE27_DATA54_0		(0x1u<<0)

// HUFFBASE28 Configuration

#define	JPEG_HUFFBASE28_DATA57			(0x1FFu<<16)
#define	JPEG_HUFFBASE28_DATA57_0		(0x1u<<16)
#define	JPEG_HUFFBASE28_DATA56			(0x1FFu<<0)
#define	JPEG_HUFFBASE28_DATA56_0		(0x1u<<0)

// HUFFBASE29 Configuration

#define	JPEG_HUFFBASE29_DATA59			(0x1FFu<<16)
#define	JPEG_HUFFBASE29_DATA59_0		(0x1u<<16)
#define	JPEG_HUFFBASE29_DATA58			(0x1FFu<<0)
#define	JPEG_HUFFBASE29_DATA58_0		(0x1u<<0)

// HUFFBASE30 Configuration

#define	JPEG_HUFFBASE30_DATA61			(0x1FFu<<16)
#define	JPEG_HUFFBASE30_DATA61_0		(0x1u<<16)
#define	JPEG_HUFFBASE30_DATA60			(0x1FFu<<0)
#define	JPEG_HUFFBASE30_DATA60_0		(0x1u<<0)

// HUFFBASE31 Configuration

#define	JPEG_HUFFBASE31_DATA63			(0x1FFu<<16)
#define	JPEG_HUFFBASE31_DATA63_0		(0x1u<<16)
#define	JPEG_HUFFBASE31_DATA62			(0x1FFu<<0)
#define	JPEG_HUFFBASE31_DATA62_0		(0x1u<<0)

// HUFFSYMB0 Configuration

#define	JPEG_HUFFSYMB0_DATA3			(0xFFu<<24)
#define	JPEG_HUFFSYMB0_DATA3_0			(0x1u<<24)
#define	JPEG_HUFFSYMB0_DATA2			(0xFFu<<16)
#define	JPEG_HUFFSYMB0_DATA2_0			(0x1u<<16)
#define	JPEG_HUFFSYMB0_DATA1			(0xFFu<<8)
#define	JPEG_HUFFSYMB0_DATA1_0			(0x1u<<8)
#define	JPEG_HUFFSYMB0_DATA0			(0xFFu<<0)
#define	JPEG_HUFFSYMB0_DATA0_0			(0x1u<<0)

