hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
// HUFFSYMB1 Configuration

#define	JPEG_HUFFSYMB1_DATA7			(0xFFu<<24)
#define	JPEG_HUFFSYMB1_DATA7_0			(0x1u<<24)
#define	JPEG_HUFFSYMB1_DATA6			(0xFFu<<16)
#define	JPEG_HUFFSYMB1_DATA6_0			(0x1u<<16)
#define	JPEG_HUFFSYMB1_DATA5			(0xFFu<<8)
#define	JPEG_HUFFSYMB1_DATA5_0			(0x1u<<8)
#define	JPEG_HUFFSYMB1_DATA4			(0xFFu<<0)
#define	JPEG_HUFFSYMB1_DATA4_0			(0x1u<<0)

// HUFFSYMB2 Configuration

#define	JPEG_HUFFSYMB2_DATA11			(0xFFu<<24)
#define	JPEG_HUFFSYMB2_DATA11_0			(0x1u<<24)
#define	JPEG_HUFFSYMB2_DATA10			(0xFFu<<16)
#define	JPEG_HUFFSYMB2_DATA10_0			(0x1u<<16)
#define	JPEG_HUFFSYMB2_DATA9			(0xFFu<<8)
#define	JPEG_HUFFSYMB2_DATA9_0			(0x1u<<8)
#define	JPEG_HUFFSYMB2_DATA8			(0xFFu<<0)
#define	JPEG_HUFFSYMB2_DATA8_0			(0x1u<<0)

// HUFFSYMB3 Configuration

#define	JPEG_HUFFSYMB3_DATA15			(0xFFu<<24)
#define	JPEG_HUFFSYMB3_DATA15_0			(0x1u<<24)
#define	JPEG_HUFFSYMB3_DATA14			(0xFFu<<16)
#define	JPEG_HUFFSYMB3_DATA14_0			(0x1u<<16)
#define	JPEG_HUFFSYMB3_DATA13			(0xFFu<<8)
#define	JPEG_HUFFSYMB3_DATA13_0			(0x1u<<8)
#define	JPEG_HUFFSYMB3_DATA12			(0xFFu<<0)
#define	JPEG_HUFFSYMB3_DATA12_0			(0x1u<<0)

// HUFFSYMB4 Configuration

#define	JPEG_HUFFSYMB4_DATA19			(0xFFu<<24)
#define	JPEG_HUFFSYMB4_DATA19_0			(0x1u<<24)
#define	JPEG_HUFFSYMB4_DATA18			(0xFFu<<16)
#define	JPEG_HUFFSYMB4_DATA18_0			(0x1u<<16)
#define	JPEG_HUFFSYMB4_DATA17			(0xFFu<<8)
#define	JPEG_HUFFSYMB4_DATA17_0			(0x1u<<8)
#define	JPEG_HUFFSYMB4_DATA16			(0xFFu<<0)
#define	JPEG_HUFFSYMB4_DATA16_0			(0x1u<<0)

// HUFFSYMB5 Configuration

#define	JPEG_HUFFSYMB5_DATA23			(0xFFu<<24)
#define	JPEG_HUFFSYMB5_DATA23_0			(0x1u<<24)
#define	JPEG_HUFFSYMB5_DATA22			(0xFFu<<16)
#define	JPEG_HUFFSYMB5_DATA22_0			(0x1u<<16)
#define	JPEG_HUFFSYMB5_DATA21			(0xFFu<<8)
#define	JPEG_HUFFSYMB5_DATA21_0			(0x1u<<8)
#define	JPEG_HUFFSYMB5_DATA20			(0xFFu<<0)
#define	JPEG_HUFFSYMB5_DATA20_0			(0x1u<<0)

// HUFFSYMB6 Configuration

#define	JPEG_HUFFSYMB6_DATA27			(0xFFu<<24)
#define	JPEG_HUFFSYMB6_DATA27_0			(0x1u<<24)
#define	JPEG_HUFFSYMB6_DATA26			(0xFFu<<16)
#define	JPEG_HUFFSYMB6_DATA26_0			(0x1u<<16)
#define	JPEG_HUFFSYMB6_DATA25			(0xFFu<<8)
#define	JPEG_HUFFSYMB6_DATA25_0			(0x1u<<8)
#define	JPEG_HUFFSYMB6_DATA24			(0xFFu<<0)
#define	JPEG_HUFFSYMB6_DATA24_0			(0x1u<<0)

// HUFFSYMB7 Configuration

#define	JPEG_HUFFSYMB7_DATA31			(0xFFu<<24)
#define	JPEG_HUFFSYMB7_DATA31_0			(0x1u<<24)
#define	JPEG_HUFFSYMB7_DATA30			(0xFFu<<16)
#define	JPEG_HUFFSYMB7_DATA30_0			(0x1u<<16)
#define	JPEG_HUFFSYMB7_DATA29			(0xFFu<<8)
#define	JPEG_HUFFSYMB7_DATA29_0			(0x1u<<8)
#define	JPEG_HUFFSYMB7_DATA28			(0xFFu<<0)
#define	JPEG_HUFFSYMB7_DATA28_0			(0x1u<<0)

// HUFFSYMB8 Configuration

#define	JPEG_HUFFSYMB8_DATA35			(0xFFu<<24)
#define	JPEG_HUFFSYMB8_DATA35_0			(0x1u<<24)
#define	JPEG_HUFFSYMB8_DATA34			(0xFFu<<16)
#define	JPEG_HUFFSYMB8_DATA34_0			(0x1u<<16)
#define	JPEG_HUFFSYMB8_DATA33			(0xFFu<<8)
#define	JPEG_HUFFSYMB8_DATA33_0			(0x1u<<8)
#define	JPEG_HUFFSYMB8_DATA32			(0xFFu<<0)
#define	JPEG_HUFFSYMB8_DATA32_0			(0x1u<<0)

// HUFFSYMB9 Configuration

#define	JPEG_HUFFSYMB9_DATA39			(0xFFu<<24)
#define	JPEG_HUFFSYMB9_DATA39_0			(0x1u<<24)
#define	JPEG_HUFFSYMB9_DATA38			(0xFFu<<16)
#define	JPEG_HUFFSYMB9_DATA38_0			(0x1u<<16)
#define	JPEG_HUFFSYMB9_DATA37			(0xFFu<<8)
#define	JPEG_HUFFSYMB9_DATA37_0			(0x1u<<8)
#define	JPEG_HUFFSYMB9_DATA36			(0xFFu<<0)
#define	JPEG_HUFFSYMB9_DATA36_0			(0x1u<<0)

// HUFFSYMB10 Configuration

#define	JPEG_HUFFSYMB10_DATA43			(0xFFu<<24)
#define	JPEG_HUFFSYMB10_DATA43_0		(0x1u<<24)
#define	JPEG_HUFFSYMB10_DATA42			(0xFFu<<16)
#define	JPEG_HUFFSYMB10_DATA42_0		(0x1u<<16)
#define	JPEG_HUFFSYMB10_DATA41			(0xFFu<<8)
#define	JPEG_HUFFSYMB10_DATA41_0		(0x1u<<8)
#define	JPEG_HUFFSYMB10_DATA40			(0xFFu<<0)
#define	JPEG_HUFFSYMB10_DATA40_0		(0x1u<<0)

// HUFFSYMB11 Configuration

#define	JPEG_HUFFSYMB11_DATA47			(0xFFu<<24)
#define	JPEG_HUFFSYMB11_DATA47_0		(0x1u<<24)
#define	JPEG_HUFFSYMB11_DATA46			(0xFFu<<16)
#define	JPEG_HUFFSYMB11_DATA46_0		(0x1u<<16)
#define	JPEG_HUFFSYMB11_DATA45			(0xFFu<<8)
#define	JPEG_HUFFSYMB11_DATA45_0		(0x1u<<8)
#define	JPEG_HUFFSYMB11_DATA44			(0xFFu<<0)
#define	JPEG_HUFFSYMB11_DATA44_0		(0x1u<<0)

// HUFFSYMB12 Configuration

#define	JPEG_HUFFSYMB12_DATA51			(0xFFu<<24)
#define	JPEG_HUFFSYMB12_DATA51_0		(0x1u<<24)
#define	JPEG_HUFFSYMB12_DATA50			(0xFFu<<16)
#define	JPEG_HUFFSYMB12_DATA50_0		(0x1u<<16)
#define	JPEG_HUFFSYMB12_DATA49			(0xFFu<<8)
#define	JPEG_HUFFSYMB12_DATA49_0		(0x1u<<8)
#define	JPEG_HUFFSYMB12_DATA48			(0xFFu<<0)
#define	JPEG_HUFFSYMB12_DATA48_0		(0x1u<<0)

// HUFFSYMB13 Configuration

#define	JPEG_HUFFSYMB13_DATA55			(0xFFu<<24)
#define	JPEG_HUFFSYMB13_DATA55_0		(0x1u<<24)
#define	JPEG_HUFFSYMB13_DATA54			(0xFFu<<16)
#define	JPEG_HUFFSYMB13_DATA54_0		(0x1u<<16)
#define	JPEG_HUFFSYMB13_DATA53			(0xFFu<<8)
#define	JPEG_HUFFSYMB13_DATA53_0		(0x1u<<8)
#define	JPEG_HUFFSYMB13_DATA52			(0xFFu<<0)
#define	JPEG_HUFFSYMB13_DATA52_0		(0x1u<<0)

// HUFFSYMB14 Configuration

#define	JPEG_HUFFSYMB14_DATA59			(0xFFu<<24)
#define	JPEG_HUFFSYMB14_DATA59_0		(0x1u<<24)
#define	JPEG_HUFFSYMB14_DATA58			(0xFFu<<16)
#define	JPEG_HUFFSYMB14_DATA58_0		(0x1u<<16)
#define	JPEG_HUFFSYMB14_DATA57			(0xFFu<<8)
#define	JPEG_HUFFSYMB14_DATA57_0		(0x1u<<8)
#define	JPEG_HUFFSYMB14_DATA56			(0xFFu<<0)
#define	JPEG_HUFFSYMB14_DATA56_0		(0x1u<<0)

// HUFFSYMB15 Configuration

#define	JPEG_HUFFSYMB15_DATA63			(0xFFu<<24)
#define	JPEG_HUFFSYMB15_DATA63_0		(0x1u<<24)
#define	JPEG_HUFFSYMB15_DATA62			(0xFFu<<16)
#define	JPEG_HUFFSYMB15_DATA62_0		(0x1u<<16)
#define	JPEG_HUFFSYMB15_DATA61			(0xFFu<<8)
#define	JPEG_HUFFSYMB15_DATA61_0		(0x1u<<8)
#define	JPEG_HUFFSYMB15_DATA60			(0xFFu<<0)
#define	JPEG_HUFFSYMB15_DATA60_0		(0x1u<<0)

// HUFFSYMB16 Configuration

#define	JPEG_HUFFSYMB16_DATA67			(0xFFu<<24)
#define	JPEG_HUFFSYMB16_DATA67_0		(0x1u<<24)
#define	JPEG_HUFFSYMB16_DATA66			(0xFFu<<16)
#define	JPEG_HUFFSYMB16_DATA66_0		(0x1u<<16)
#define	JPEG_HUFFSYMB16_DATA65			(0xFFu<<8)
#define	JPEG_HUFFSYMB16_DATA65_0		(0x1u<<8)
#define	JPEG_HUFFSYMB16_DATA64			(0xFFu<<0)
#define	JPEG_HUFFSYMB16_DATA64_0		(0x1u<<0)

// HUFFSYMB17 Configuration

#define	JPEG_HUFFSYMB17_DATA71			(0xFFu<<24)
#define	JPEG_HUFFSYMB17_DATA71_0		(0x1u<<24)
#define	JPEG_HUFFSYMB17_DATA70			(0xFFu<<16)
#define	JPEG_HUFFSYMB17_DATA70_0		(0x1u<<16)
#define	JPEG_HUFFSYMB17_DATA69			(0xFFu<<8)
#define	JPEG_HUFFSYMB17_DATA69_0		(0x1u<<8)
#define	JPEG_HUFFSYMB17_DATA68			(0xFFu<<0)
#define	JPEG_HUFFSYMB17_DATA68_0		(0x1u<<0)

