hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
#define	JPEG_DHTMEM51_DATA207			(0xFFu<<24)
#define	JPEG_DHTMEM51_DATA207_0			(0x1u<<24)
#define	JPEG_DHTMEM51_DATA206			(0xFFu<<16)
#define	JPEG_DHTMEM51_DATA206_0			(0x1u<<16)
#define	JPEG_DHTMEM51_DATA205			(0xFFu<<8)
#define	JPEG_DHTMEM51_DATA205_0			(0x1u<<8)
#define	JPEG_DHTMEM51_DATA204			(0xFFu<<0)
#define	JPEG_DHTMEM51_DATA204_0			(0x1u<<0)

// DHTMEM52 Configuration

#define	JPEG_DHTMEM52_DATA211			(0xFFu<<24)
#define	JPEG_DHTMEM52_DATA211_0			(0x1u<<24)
#define	JPEG_DHTMEM52_DATA210			(0xFFu<<16)
#define	JPEG_DHTMEM52_DATA210_0			(0x1u<<16)
#define	JPEG_DHTMEM52_DATA209			(0xFFu<<8)
#define	JPEG_DHTMEM52_DATA209_0			(0x1u<<8)
#define	JPEG_DHTMEM52_DATA208			(0xFFu<<0)
#define	JPEG_DHTMEM52_DATA208_0			(0x1u<<0)

// DHTMEM53 Configuration

#define	JPEG_DHTMEM53_DATA215			(0xFFu<<24)
#define	JPEG_DHTMEM53_DATA215_0			(0x1u<<24)
#define	JPEG_DHTMEM53_DATA214			(0xFFu<<16)
#define	JPEG_DHTMEM53_DATA214_0			(0x1u<<16)
#define	JPEG_DHTMEM53_DATA213			(0xFFu<<8)
#define	JPEG_DHTMEM53_DATA213_0			(0x1u<<8)
#define	JPEG_DHTMEM53_DATA212			(0xFFu<<0)
#define	JPEG_DHTMEM53_DATA212_0			(0x1u<<0)

// DHTMEM54 Configuration

#define	JPEG_DHTMEM54_DATA219			(0xFFu<<24)
#define	JPEG_DHTMEM54_DATA219_0			(0x1u<<24)
#define	JPEG_DHTMEM54_DATA218			(0xFFu<<16)
#define	JPEG_DHTMEM54_DATA218_0			(0x1u<<16)
#define	JPEG_DHTMEM54_DATA217			(0xFFu<<8)
#define	JPEG_DHTMEM54_DATA217_0			(0x1u<<8)
#define	JPEG_DHTMEM54_DATA216			(0xFFu<<0)
#define	JPEG_DHTMEM54_DATA216_0			(0x1u<<0)

// DHTMEM55 Configuration

#define	JPEG_DHTMEM55_DATA223			(0xFFu<<24)
#define	JPEG_DHTMEM55_DATA223_0			(0x1u<<24)
#define	JPEG_DHTMEM55_DATA222			(0xFFu<<16)
#define	JPEG_DHTMEM55_DATA222_0			(0x1u<<16)
#define	JPEG_DHTMEM55_DATA221			(0xFFu<<8)
#define	JPEG_DHTMEM55_DATA221_0			(0x1u<<8)
#define	JPEG_DHTMEM55_DATA220			(0xFFu<<0)
#define	JPEG_DHTMEM55_DATA220_0			(0x1u<<0)

// DHTMEM56 Configuration

#define	JPEG_DHTMEM56_DATA227			(0xFFu<<24)
#define	JPEG_DHTMEM56_DATA227_0			(0x1u<<24)
#define	JPEG_DHTMEM56_DATA226			(0xFFu<<16)
#define	JPEG_DHTMEM56_DATA226_0			(0x1u<<16)
#define	JPEG_DHTMEM56_DATA225			(0xFFu<<8)
#define	JPEG_DHTMEM56_DATA225_0			(0x1u<<8)
#define	JPEG_DHTMEM56_DATA224			(0xFFu<<0)
#define	JPEG_DHTMEM56_DATA224_0			(0x1u<<0)

// DHTMEM57 Configuration

#define	JPEG_DHTMEM57_DATA231			(0xFFu<<24)
#define	JPEG_DHTMEM57_DATA231_0			(0x1u<<24)
#define	JPEG_DHTMEM57_DATA230			(0xFFu<<16)
#define	JPEG_DHTMEM57_DATA230_0			(0x1u<<16)
#define	JPEG_DHTMEM57_DATA229			(0xFFu<<8)
#define	JPEG_DHTMEM57_DATA229_0			(0x1u<<8)
#define	JPEG_DHTMEM57_DATA228			(0xFFu<<0)
#define	JPEG_DHTMEM57_DATA228_0			(0x1u<<0)

// DHTMEM58 Configuration

#define	JPEG_DHTMEM58_DATA235			(0xFFu<<24)
#define	JPEG_DHTMEM58_DATA235_0			(0x1u<<24)
#define	JPEG_DHTMEM58_DATA234			(0xFFu<<16)
#define	JPEG_DHTMEM58_DATA234_0			(0x1u<<16)
#define	JPEG_DHTMEM58_DATA233			(0xFFu<<8)
#define	JPEG_DHTMEM58_DATA233_0			(0x1u<<8)
#define	JPEG_DHTMEM58_DATA232			(0xFFu<<0)
#define	JPEG_DHTMEM58_DATA232_0			(0x1u<<0)

// DHTMEM59 Configuration

#define	JPEG_DHTMEM59_DATA239			(0xFFu<<24)
#define	JPEG_DHTMEM59_DATA239_0			(0x1u<<24)
#define	JPEG_DHTMEM59_DATA238			(0xFFu<<16)
#define	JPEG_DHTMEM59_DATA238_0			(0x1u<<16)
#define	JPEG_DHTMEM59_DATA237			(0xFFu<<8)
#define	JPEG_DHTMEM59_DATA237_0			(0x1u<<8)
#define	JPEG_DHTMEM59_DATA236			(0xFFu<<0)
#define	JPEG_DHTMEM59_DATA236_0			(0x1u<<0)

// DHTMEM60 Configuration

#define	JPEG_DHTMEM60_DATA243			(0xFFu<<24)
#define	JPEG_DHTMEM60_DATA243_0			(0x1u<<24)
#define	JPEG_DHTMEM60_DATA242			(0xFFu<<16)
#define	JPEG_DHTMEM60_DATA242_0			(0x1u<<16)
#define	JPEG_DHTMEM60_DATA241			(0xFFu<<8)
#define	JPEG_DHTMEM60_DATA241_0			(0x1u<<8)
#define	JPEG_DHTMEM60_DATA240			(0xFFu<<0)
#define	JPEG_DHTMEM60_DATA240_0			(0x1u<<0)

// DHTMEM61 Configuration

#define	JPEG_DHTMEM61_DATA247			(0xFFu<<24)
#define	JPEG_DHTMEM61_DATA247_0			(0x1u<<24)
#define	JPEG_DHTMEM61_DATA246			(0xFFu<<16)
#define	JPEG_DHTMEM61_DATA246_0			(0x1u<<16)
#define	JPEG_DHTMEM61_DATA245			(0xFFu<<8)
#define	JPEG_DHTMEM61_DATA245_0			(0x1u<<8)
#define	JPEG_DHTMEM61_DATA244			(0xFFu<<0)
#define	JPEG_DHTMEM61_DATA244_0			(0x1u<<0)

// DHTMEM62 Configuration

#define	JPEG_DHTMEM62_DATA251			(0xFFu<<24)
#define	JPEG_DHTMEM62_DATA251_0			(0x1u<<24)
#define	JPEG_DHTMEM62_DATA250			(0xFFu<<16)
#define	JPEG_DHTMEM62_DATA250_0			(0x1u<<16)
#define	JPEG_DHTMEM62_DATA249			(0xFFu<<8)
#define	JPEG_DHTMEM62_DATA249_0			(0x1u<<8)
#define	JPEG_DHTMEM62_DATA248			(0xFFu<<0)
#define	JPEG_DHTMEM62_DATA248_0			(0x1u<<0)

// DHTMEM63 Configuration

#define	JPEG_DHTMEM63_DATA255			(0xFFu<<24)
#define	JPEG_DHTMEM63_DATA255_0			(0x1u<<24)
#define	JPEG_DHTMEM63_DATA254			(0xFFu<<16)
#define	JPEG_DHTMEM63_DATA254_0			(0x1u<<16)
#define	JPEG_DHTMEM63_DATA253			(0xFFu<<8)
#define	JPEG_DHTMEM63_DATA253_0			(0x1u<<8)
#define	JPEG_DHTMEM63_DATA252			(0xFFu<<0)
#define	JPEG_DHTMEM63_DATA252_0			(0x1u<<0)

// DHTMEM64 Configuration

#define	JPEG_DHTMEM64_DATA259			(0xFFu<<24)
#define	JPEG_DHTMEM64_DATA259_0			(0x1u<<24)
#define	JPEG_DHTMEM64_DATA258			(0xFFu<<16)
#define	JPEG_DHTMEM64_DATA258_0			(0x1u<<16)
#define	JPEG_DHTMEM64_DATA257			(0xFFu<<8)
#define	JPEG_DHTMEM64_DATA257_0			(0x1u<<8)
#define	JPEG_DHTMEM64_DATA256			(0xFFu<<0)
#define	JPEG_DHTMEM64_DATA256_0			(0x1u<<0)

// DHTMEM65 Configuration

#define	JPEG_DHTMEM65_DATA263			(0xFFu<<24)
#define	JPEG_DHTMEM65_DATA263_0			(0x1u<<24)
#define	JPEG_DHTMEM65_DATA262			(0xFFu<<16)
#define	JPEG_DHTMEM65_DATA262_0			(0x1u<<16)
#define	JPEG_DHTMEM65_DATA261			(0xFFu<<8)
#define	JPEG_DHTMEM65_DATA261_0			(0x1u<<8)
#define	JPEG_DHTMEM65_DATA260			(0xFFu<<0)
#define	JPEG_DHTMEM65_DATA260_0			(0x1u<<0)

// DHTMEM66 Configuration

#define	JPEG_DHTMEM66_DATA267			(0xFFu<<24)
#define	JPEG_DHTMEM66_DATA267_0			(0x1u<<24)
#define	JPEG_DHTMEM66_DATA266			(0xFFu<<16)
#define	JPEG_DHTMEM66_DATA266_0			(0x1u<<16)
#define	JPEG_DHTMEM66_DATA265			(0xFFu<<8)
#define	JPEG_DHTMEM66_DATA265_0			(0x1u<<8)
#define	JPEG_DHTMEM66_DATA264			(0xFFu<<0)
#define	JPEG_DHTMEM66_DATA264_0			(0x1u<<0)

// DHTMEM67 Configuration

#define	JPEG_DHTMEM67_DATA271			(0xFFu<<24)
#define	JPEG_DHTMEM67_DATA271_0			(0x1u<<24)
#define	JPEG_DHTMEM67_DATA270			(0xFFu<<16)
#define	JPEG_DHTMEM67_DATA270_0			(0x1u<<16)
#define	JPEG_DHTMEM67_DATA269			(0xFFu<<8)
#define	JPEG_DHTMEM67_DATA269_0			(0x1u<<8)
#define	JPEG_DHTMEM67_DATA268			(0xFFu<<0)
#define	JPEG_DHTMEM67_DATA268_0			(0x1u<<0)

// DHTMEM68 Configuration

#define	JPEG_DHTMEM68_DATA275			(0xFFu<<24)
#define	JPEG_DHTMEM68_DATA275_0			(0x1u<<24)
#define	JPEG_DHTMEM68_DATA274			(0xFFu<<16)
#define	JPEG_DHTMEM68_DATA274_0			(0x1u<<16)
#define	JPEG_DHTMEM68_DATA273			(0xFFu<<8)
#define	JPEG_DHTMEM68_DATA273_0			(0x1u<<8)
#define	JPEG_DHTMEM68_DATA272			(0xFFu<<0)
#define	JPEG_DHTMEM68_DATA272_0			(0x1u<<0)

// DHTMEM69 Configuration

#define	JPEG_DHTMEM69_DATA279			(0xFFu<<24)
#define	JPEG_DHTMEM69_DATA279_0			(0x1u<<24)
#define	JPEG_DHTMEM69_DATA278			(0xFFu<<16)
#define	JPEG_DHTMEM69_DATA278_0			(0x1u<<16)
#define	JPEG_DHTMEM69_DATA277			(0xFFu<<8)
#define	JPEG_DHTMEM69_DATA277_0			(0x1u<<8)
#define	JPEG_DHTMEM69_DATA276			(0xFFu<<0)
#define	JPEG_DHTMEM69_DATA276_0			(0x1u<<0)

