hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
// DHTMEM70 Configuration

#define	JPEG_DHTMEM70_DATA283			(0xFFu<<24)
#define	JPEG_DHTMEM70_DATA283_0			(0x1u<<24)
#define	JPEG_DHTMEM70_DATA282			(0xFFu<<16)
#define	JPEG_DHTMEM70_DATA282_0			(0x1u<<16)
#define	JPEG_DHTMEM70_DATA281			(0xFFu<<8)
#define	JPEG_DHTMEM70_DATA281_0			(0x1u<<8)
#define	JPEG_DHTMEM70_DATA280			(0xFFu<<0)
#define	JPEG_DHTMEM70_DATA280_0			(0x1u<<0)

// DHTMEM71 Configuration

#define	JPEG_DHTMEM71_DATA287			(0xFFu<<24)
#define	JPEG_DHTMEM71_DATA287_0			(0x1u<<24)
#define	JPEG_DHTMEM71_DATA286			(0xFFu<<16)
#define	JPEG_DHTMEM71_DATA286_0			(0x1u<<16)
#define	JPEG_DHTMEM71_DATA285			(0xFFu<<8)
#define	JPEG_DHTMEM71_DATA285_0			(0x1u<<8)
#define	JPEG_DHTMEM71_DATA284			(0xFFu<<0)
#define	JPEG_DHTMEM71_DATA284_0			(0x1u<<0)

// DHTMEM72 Configuration

#define	JPEG_DHTMEM72_DATA291			(0xFFu<<24)
#define	JPEG_DHTMEM72_DATA291_0			(0x1u<<24)
#define	JPEG_DHTMEM72_DATA290			(0xFFu<<16)
#define	JPEG_DHTMEM72_DATA290_0			(0x1u<<16)
#define	JPEG_DHTMEM72_DATA289			(0xFFu<<8)
#define	JPEG_DHTMEM72_DATA289_0			(0x1u<<8)
#define	JPEG_DHTMEM72_DATA288			(0xFFu<<0)
#define	JPEG_DHTMEM72_DATA288_0			(0x1u<<0)

// DHTMEM73 Configuration

#define	JPEG_DHTMEM73_DATA295			(0xFFu<<24)
#define	JPEG_DHTMEM73_DATA295_0			(0x1u<<24)
#define	JPEG_DHTMEM73_DATA294			(0xFFu<<16)
#define	JPEG_DHTMEM73_DATA294_0			(0x1u<<16)
#define	JPEG_DHTMEM73_DATA293			(0xFFu<<8)
#define	JPEG_DHTMEM73_DATA293_0			(0x1u<<8)
#define	JPEG_DHTMEM73_DATA292			(0xFFu<<0)
#define	JPEG_DHTMEM73_DATA292_0			(0x1u<<0)

// DHTMEM74 Configuration

#define	JPEG_DHTMEM74_DATA299			(0xFFu<<24)
#define	JPEG_DHTMEM74_DATA299_0			(0x1u<<24)
#define	JPEG_DHTMEM74_DATA298			(0xFFu<<16)
#define	JPEG_DHTMEM74_DATA298_0			(0x1u<<16)
#define	JPEG_DHTMEM74_DATA297			(0xFFu<<8)
#define	JPEG_DHTMEM74_DATA297_0			(0x1u<<8)
#define	JPEG_DHTMEM74_DATA296			(0xFFu<<0)
#define	JPEG_DHTMEM74_DATA296_0			(0x1u<<0)

// DHTMEM75 Configuration

#define	JPEG_DHTMEM75_DATA303			(0xFFu<<24)
#define	JPEG_DHTMEM75_DATA303_0			(0x1u<<24)
#define	JPEG_DHTMEM75_DATA302			(0xFFu<<16)
#define	JPEG_DHTMEM75_DATA302_0			(0x1u<<16)
#define	JPEG_DHTMEM75_DATA301			(0xFFu<<8)
#define	JPEG_DHTMEM75_DATA301_0			(0x1u<<8)
#define	JPEG_DHTMEM75_DATA300			(0xFFu<<0)
#define	JPEG_DHTMEM75_DATA300_0			(0x1u<<0)

// DHTMEM76 Configuration

#define	JPEG_DHTMEM76_DATA307			(0xFFu<<24)
#define	JPEG_DHTMEM76_DATA307_0			(0x1u<<24)
#define	JPEG_DHTMEM76_DATA306			(0xFFu<<16)
#define	JPEG_DHTMEM76_DATA306_0			(0x1u<<16)
#define	JPEG_DHTMEM76_DATA305			(0xFFu<<8)
#define	JPEG_DHTMEM76_DATA305_0			(0x1u<<8)
#define	JPEG_DHTMEM76_DATA304			(0xFFu<<0)
#define	JPEG_DHTMEM76_DATA304_0			(0x1u<<0)

// DHTMEM77 Configuration

#define	JPEG_DHTMEM77_DATA311			(0xFFu<<24)
#define	JPEG_DHTMEM77_DATA311_0			(0x1u<<24)
#define	JPEG_DHTMEM77_DATA310			(0xFFu<<16)
#define	JPEG_DHTMEM77_DATA310_0			(0x1u<<16)
#define	JPEG_DHTMEM77_DATA309			(0xFFu<<8)
#define	JPEG_DHTMEM77_DATA309_0			(0x1u<<8)
#define	JPEG_DHTMEM77_DATA308			(0xFFu<<0)
#define	JPEG_DHTMEM77_DATA308_0			(0x1u<<0)

// DHTMEM78 Configuration

#define	JPEG_DHTMEM78_DATA315			(0xFFu<<24)
#define	JPEG_DHTMEM78_DATA315_0			(0x1u<<24)
#define	JPEG_DHTMEM78_DATA314			(0xFFu<<16)
#define	JPEG_DHTMEM78_DATA314_0			(0x1u<<16)
#define	JPEG_DHTMEM78_DATA313			(0xFFu<<8)
#define	JPEG_DHTMEM78_DATA313_0			(0x1u<<8)
#define	JPEG_DHTMEM78_DATA312			(0xFFu<<0)
#define	JPEG_DHTMEM78_DATA312_0			(0x1u<<0)

// DHTMEM79 Configuration

#define	JPEG_DHTMEM79_DATA319			(0xFFu<<24)
#define	JPEG_DHTMEM79_DATA319_0			(0x1u<<24)
#define	JPEG_DHTMEM79_DATA318			(0xFFu<<16)
#define	JPEG_DHTMEM79_DATA318_0			(0x1u<<16)
#define	JPEG_DHTMEM79_DATA317			(0xFFu<<8)
#define	JPEG_DHTMEM79_DATA317_0			(0x1u<<8)
#define	JPEG_DHTMEM79_DATA316			(0xFFu<<0)
#define	JPEG_DHTMEM79_DATA316_0			(0x1u<<0)

// DHTMEM80 Configuration

#define	JPEG_DHTMEM80_DATA323			(0xFFu<<24)
#define	JPEG_DHTMEM80_DATA323_0			(0x1u<<24)
#define	JPEG_DHTMEM80_DATA322			(0xFFu<<16)
#define	JPEG_DHTMEM80_DATA322_0			(0x1u<<16)
#define	JPEG_DHTMEM80_DATA321			(0xFFu<<8)
#define	JPEG_DHTMEM80_DATA321_0			(0x1u<<8)
#define	JPEG_DHTMEM80_DATA320			(0xFFu<<0)
#define	JPEG_DHTMEM80_DATA320_0			(0x1u<<0)

// DHTMEM81 Configuration

#define	JPEG_DHTMEM81_DATA327			(0xFFu<<24)
#define	JPEG_DHTMEM81_DATA327_0			(0x1u<<24)
#define	JPEG_DHTMEM81_DATA326			(0xFFu<<16)
#define	JPEG_DHTMEM81_DATA326_0			(0x1u<<16)
#define	JPEG_DHTMEM81_DATA325			(0xFFu<<8)
#define	JPEG_DHTMEM81_DATA325_0			(0x1u<<8)
#define	JPEG_DHTMEM81_DATA324			(0xFFu<<0)
#define	JPEG_DHTMEM81_DATA324_0			(0x1u<<0)

// DHTMEM82 Configuration

#define	JPEG_DHTMEM82_DATA331			(0xFFu<<24)
#define	JPEG_DHTMEM82_DATA331_0			(0x1u<<24)
#define	JPEG_DHTMEM82_DATA330			(0xFFu<<16)
#define	JPEG_DHTMEM82_DATA330_0			(0x1u<<16)
#define	JPEG_DHTMEM82_DATA329			(0xFFu<<8)
#define	JPEG_DHTMEM82_DATA329_0			(0x1u<<8)
#define	JPEG_DHTMEM82_DATA328			(0xFFu<<0)
#define	JPEG_DHTMEM82_DATA328_0			(0x1u<<0)

// DHTMEM83 Configuration

#define	JPEG_DHTMEM83_DATA335			(0xFFu<<24)
#define	JPEG_DHTMEM83_DATA335_0			(0x1u<<24)
#define	JPEG_DHTMEM83_DATA334			(0xFFu<<16)
#define	JPEG_DHTMEM83_DATA334_0			(0x1u<<16)
#define	JPEG_DHTMEM83_DATA333			(0xFFu<<8)
#define	JPEG_DHTMEM83_DATA333_0			(0x1u<<8)
#define	JPEG_DHTMEM83_DATA332			(0xFFu<<0)
#define	JPEG_DHTMEM83_DATA332_0			(0x1u<<0)

// DHTMEM84 Configuration

#define	JPEG_DHTMEM84_DATA339			(0xFFu<<24)
#define	JPEG_DHTMEM84_DATA339_0			(0x1u<<24)
#define	JPEG_DHTMEM84_DATA338			(0xFFu<<16)
#define	JPEG_DHTMEM84_DATA338_0			(0x1u<<16)
#define	JPEG_DHTMEM84_DATA337			(0xFFu<<8)
#define	JPEG_DHTMEM84_DATA337_0			(0x1u<<8)
#define	JPEG_DHTMEM84_DATA336			(0xFFu<<0)
#define	JPEG_DHTMEM84_DATA336_0			(0x1u<<0)

// DHTMEM85 Configuration

#define	JPEG_DHTMEM85_DATA343			(0xFFu<<24)
#define	JPEG_DHTMEM85_DATA343_0			(0x1u<<24)
#define	JPEG_DHTMEM85_DATA342			(0xFFu<<16)
#define	JPEG_DHTMEM85_DATA342_0			(0x1u<<16)
#define	JPEG_DHTMEM85_DATA341			(0xFFu<<8)
#define	JPEG_DHTMEM85_DATA341_0			(0x1u<<8)
#define	JPEG_DHTMEM85_DATA340			(0xFFu<<0)
#define	JPEG_DHTMEM85_DATA340_0			(0x1u<<0)

