hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
// DHTMEM86 Configuration

#define	JPEG_DHTMEM86_DATA347			(0xFFu<<24)
#define	JPEG_DHTMEM86_DATA347_0			(0x1u<<24)
#define	JPEG_DHTMEM86_DATA346			(0xFFu<<16)
#define	JPEG_DHTMEM86_DATA346_0			(0x1u<<16)
#define	JPEG_DHTMEM86_DATA345			(0xFFu<<8)
#define	JPEG_DHTMEM86_DATA345_0			(0x1u<<8)
#define	JPEG_DHTMEM86_DATA344			(0xFFu<<0)
#define	JPEG_DHTMEM86_DATA344_0			(0x1u<<0)

// DHTMEM87 Configuration

#define	JPEG_DHTMEM87_DATA351			(0xFFu<<24)
#define	JPEG_DHTMEM87_DATA351_0			(0x1u<<24)
#define	JPEG_DHTMEM87_DATA350			(0xFFu<<16)
#define	JPEG_DHTMEM87_DATA350_0			(0x1u<<16)
#define	JPEG_DHTMEM87_DATA349			(0xFFu<<8)
#define	JPEG_DHTMEM87_DATA349_0			(0x1u<<8)
#define	JPEG_DHTMEM87_DATA348			(0xFFu<<0)
#define	JPEG_DHTMEM87_DATA348_0			(0x1u<<0)

// DHTMEM88 Configuration

#define	JPEG_DHTMEM88_DATA355			(0xFFu<<24)
#define	JPEG_DHTMEM88_DATA355_0			(0x1u<<24)
#define	JPEG_DHTMEM88_DATA354			(0xFFu<<16)
#define	JPEG_DHTMEM88_DATA354_0			(0x1u<<16)
#define	JPEG_DHTMEM88_DATA353			(0xFFu<<8)
#define	JPEG_DHTMEM88_DATA353_0			(0x1u<<8)
#define	JPEG_DHTMEM88_DATA352			(0xFFu<<0)
#define	JPEG_DHTMEM88_DATA352_0			(0x1u<<0)

// DHTMEM89 Configuration

#define	JPEG_DHTMEM89_DATA359			(0xFFu<<24)
#define	JPEG_DHTMEM89_DATA359_0			(0x1u<<24)
#define	JPEG_DHTMEM89_DATA358			(0xFFu<<16)
#define	JPEG_DHTMEM89_DATA358_0			(0x1u<<16)
#define	JPEG_DHTMEM89_DATA357			(0xFFu<<8)
#define	JPEG_DHTMEM89_DATA357_0			(0x1u<<8)
#define	JPEG_DHTMEM89_DATA356			(0xFFu<<0)
#define	JPEG_DHTMEM89_DATA356_0			(0x1u<<0)

// DHTMEM90 Configuration

#define	JPEG_DHTMEM90_DATA363			(0xFFu<<24)
#define	JPEG_DHTMEM90_DATA363_0			(0x1u<<24)
#define	JPEG_DHTMEM90_DATA362			(0xFFu<<16)
#define	JPEG_DHTMEM90_DATA362_0			(0x1u<<16)
#define	JPEG_DHTMEM90_DATA361			(0xFFu<<8)
#define	JPEG_DHTMEM90_DATA361_0			(0x1u<<8)
#define	JPEG_DHTMEM90_DATA360			(0xFFu<<0)
#define	JPEG_DHTMEM90_DATA360_0			(0x1u<<0)

// DHTMEM91 Configuration

#define	JPEG_DHTMEM91_DATA367			(0xFFu<<24)
#define	JPEG_DHTMEM91_DATA367_0			(0x1u<<24)
#define	JPEG_DHTMEM91_DATA366			(0xFFu<<16)
#define	JPEG_DHTMEM91_DATA366_0			(0x1u<<16)
#define	JPEG_DHTMEM91_DATA365			(0xFFu<<8)
#define	JPEG_DHTMEM91_DATA365_0			(0x1u<<8)
#define	JPEG_DHTMEM91_DATA364			(0xFFu<<0)
#define	JPEG_DHTMEM91_DATA364_0			(0x1u<<0)

// DHTMEM92 Configuration

#define	JPEG_DHTMEM92_DATA371			(0xFFu<<24)
#define	JPEG_DHTMEM92_DATA371_0			(0x1u<<24)
#define	JPEG_DHTMEM92_DATA370			(0xFFu<<16)
#define	JPEG_DHTMEM92_DATA370_0			(0x1u<<16)
#define	JPEG_DHTMEM92_DATA369			(0xFFu<<8)
#define	JPEG_DHTMEM92_DATA369_0			(0x1u<<8)
#define	JPEG_DHTMEM92_DATA368			(0xFFu<<0)
#define	JPEG_DHTMEM92_DATA368_0			(0x1u<<0)

// DHTMEM93 Configuration

#define	JPEG_DHTMEM93_DATA375			(0xFFu<<24)
#define	JPEG_DHTMEM93_DATA375_0			(0x1u<<24)
#define	JPEG_DHTMEM93_DATA374			(0xFFu<<16)
#define	JPEG_DHTMEM93_DATA374_0			(0x1u<<16)
#define	JPEG_DHTMEM93_DATA373			(0xFFu<<8)
#define	JPEG_DHTMEM93_DATA373_0			(0x1u<<8)
#define	JPEG_DHTMEM93_DATA372			(0xFFu<<0)
#define	JPEG_DHTMEM93_DATA372_0			(0x1u<<0)

// DHTMEM94 Configuration

#define	JPEG_DHTMEM94_DATA379			(0xFFu<<24)
#define	JPEG_DHTMEM94_DATA379_0			(0x1u<<24)
#define	JPEG_DHTMEM94_DATA378			(0xFFu<<16)
#define	JPEG_DHTMEM94_DATA378_0			(0x1u<<16)
#define	JPEG_DHTMEM94_DATA377			(0xFFu<<8)
#define	JPEG_DHTMEM94_DATA377_0			(0x1u<<8)
#define	JPEG_DHTMEM94_DATA376			(0xFFu<<0)
#define	JPEG_DHTMEM94_DATA376_0			(0x1u<<0)

// DHTMEM95 Configuration

#define	JPEG_DHTMEM95_DATA383			(0xFFu<<24)
#define	JPEG_DHTMEM95_DATA383_0			(0x1u<<24)
#define	JPEG_DHTMEM95_DATA382			(0xFFu<<16)
#define	JPEG_DHTMEM95_DATA382_0			(0x1u<<16)
#define	JPEG_DHTMEM95_DATA381			(0xFFu<<8)
#define	JPEG_DHTMEM95_DATA381_0			(0x1u<<8)
#define	JPEG_DHTMEM95_DATA380			(0xFFu<<0)
#define	JPEG_DHTMEM95_DATA380_0			(0x1u<<0)

// DHTMEM96 Configuration

#define	JPEG_DHTMEM96_DATA387			(0xFFu<<24)
#define	JPEG_DHTMEM96_DATA387_0			(0x1u<<24)
#define	JPEG_DHTMEM96_DATA386			(0xFFu<<16)
#define	JPEG_DHTMEM96_DATA386_0			(0x1u<<16)
#define	JPEG_DHTMEM96_DATA385			(0xFFu<<8)
#define	JPEG_DHTMEM96_DATA385_0			(0x1u<<8)
#define	JPEG_DHTMEM96_DATA384			(0xFFu<<0)
#define	JPEG_DHTMEM96_DATA384_0			(0x1u<<0)

// DHTMEM97 Configuration

#define	JPEG_DHTMEM97_DATA391			(0xFFu<<24)
#define	JPEG_DHTMEM97_DATA391_0			(0x1u<<24)
#define	JPEG_DHTMEM97_DATA390			(0xFFu<<16)
#define	JPEG_DHTMEM97_DATA390_0			(0x1u<<16)
#define	JPEG_DHTMEM97_DATA389			(0xFFu<<8)
#define	JPEG_DHTMEM97_DATA389_0			(0x1u<<8)
#define	JPEG_DHTMEM97_DATA388			(0xFFu<<0)
#define	JPEG_DHTMEM97_DATA388_0			(0x1u<<0)

// DHTMEM98 Configuration

#define	JPEG_DHTMEM98_DATA395			(0xFFu<<24)
#define	JPEG_DHTMEM98_DATA395_0			(0x1u<<24)
#define	JPEG_DHTMEM98_DATA394			(0xFFu<<16)
#define	JPEG_DHTMEM98_DATA394_0			(0x1u<<16)
#define	JPEG_DHTMEM98_DATA393			(0xFFu<<8)
#define	JPEG_DHTMEM98_DATA393_0			(0x1u<<8)
#define	JPEG_DHTMEM98_DATA392			(0xFFu<<0)
#define	JPEG_DHTMEM98_DATA392_0			(0x1u<<0)

// DHTMEM99 Configuration

#define	JPEG_DHTMEM99_DATA399			(0xFFu<<24)
#define	JPEG_DHTMEM99_DATA399_0			(0x1u<<24)
#define	JPEG_DHTMEM99_DATA398			(0xFFu<<16)
#define	JPEG_DHTMEM99_DATA398_0			(0x1u<<16)
#define	JPEG_DHTMEM99_DATA397			(0xFFu<<8)
#define	JPEG_DHTMEM99_DATA397_0			(0x1u<<8)
#define	JPEG_DHTMEM99_DATA396			(0xFFu<<0)
#define	JPEG_DHTMEM99_DATA396_0			(0x1u<<0)

// DHTMEM100 Configuration

#define	JPEG_DHTMEM100_DATA403			(0xFFu<<24)
#define	JPEG_DHTMEM100_DATA403_0		(0x1u<<24)
#define	JPEG_DHTMEM100_DATA402			(0xFFu<<16)
#define	JPEG_DHTMEM100_DATA402_0		(0x1u<<16)
#define	JPEG_DHTMEM100_DATA401			(0xFFu<<8)
#define	JPEG_DHTMEM100_DATA401_0		(0x1u<<8)
#define	JPEG_DHTMEM100_DATA400			(0xFFu<<0)
#define	JPEG_DHTMEM100_DATA400_0		(0x1u<<0)

// DHTMEM101 Configuration

#define	JPEG_DHTMEM101_DATA407			(0xFFu<<24)
#define	JPEG_DHTMEM101_DATA407_0		(0x1u<<24)
#define	JPEG_DHTMEM101_DATA406			(0xFFu<<16)
#define	JPEG_DHTMEM101_DATA406_0		(0x1u<<16)
#define	JPEG_DHTMEM101_DATA405			(0xFFu<<8)
#define	JPEG_DHTMEM101_DATA405_0		(0x1u<<8)
#define	JPEG_DHTMEM101_DATA404			(0xFFu<<0)
#define	JPEG_DHTMEM101_DATA404_0		(0x1u<<0)

// DHTMEM102 Configuration

#define	JPEG_DHTMEM102_DATA411			(0xFFu<<24)
#define	JPEG_DHTMEM102_DATA411_0		(0x1u<<24)
#define	JPEG_DHTMEM102_DATA410			(0xFFu<<16)
#define	JPEG_DHTMEM102_DATA410_0		(0x1u<<16)
#define	JPEG_DHTMEM102_DATA409			(0xFFu<<8)
#define	JPEG_DHTMEM102_DATA409_0		(0x1u<<8)
#define	JPEG_DHTMEM102_DATA408			(0xFFu<<0)
#define	JPEG_DHTMEM102_DATA408_0		(0x1u<<0)

// HUFFENC_AC0_0 Configuration

#define	JPEG_HUFFENC_AC0_0_HLEN1		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_0_HLEN1_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC0_0_HCODE1		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_0_HCODE1_0		(0x1u<<16)
#define	JPEG_HUFFENC_AC0_0_HLEN0		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_0_HLEN0_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC0_0_HCODE0		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_0_HCODE0_0		(0x1u<<0)

// HUFFENC_AC0_1 Configuration

#define	JPEG_HUFFENC_AC0_1_HLEN3		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_1_HLEN3_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC0_1_HCODE3		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_1_HCODE3_0		(0x1u<<16)
#define	JPEG_HUFFENC_AC0_1_HLEN2		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_1_HLEN2_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC0_1_HCODE2		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_1_HCODE2_0		(0x1u<<0)

