hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
// HUFFENC_AC0_2 Configuration

#define	JPEG_HUFFENC_AC0_2_HLEN5		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_2_HLEN5_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC0_2_HCODE5		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_2_HCODE5_0		(0x1u<<16)
#define	JPEG_HUFFENC_AC0_2_HLEN4		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_2_HLEN4_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC0_2_HCODE4		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_2_HCODE4_0		(0x1u<<0)

// HUFFENC_AC0_3 Configuration

#define	JPEG_HUFFENC_AC0_3_HLEN7		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_3_HLEN7_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC0_3_HCODE7		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_3_HCODE7_0		(0x1u<<16)
#define	JPEG_HUFFENC_AC0_3_HLEN6		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_3_HLEN6_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC0_3_HCODE6		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_3_HCODE6_0		(0x1u<<0)

// HUFFENC_AC0_4 Configuration

#define	JPEG_HUFFENC_AC0_4_HLEN9		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_4_HLEN9_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC0_4_HCODE9		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_4_HCODE9_0		(0x1u<<16)
#define	JPEG_HUFFENC_AC0_4_HLEN8		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_4_HLEN8_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC0_4_HCODE8		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_4_HCODE8_0		(0x1u<<0)

// HUFFENC_AC0_5 Configuration

#define	JPEG_HUFFENC_AC0_5_HLEN11		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_5_HLEN11_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC0_5_HCODE11		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_5_HCODE11_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_5_HLEN10		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_5_HLEN10_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC0_5_HCODE10		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_5_HCODE10_0	(0x1u<<0)

// HUFFENC_AC0_6 Configuration

#define	JPEG_HUFFENC_AC0_6_HLEN13		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_6_HLEN13_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC0_6_HCODE13		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_6_HCODE13_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_6_HLEN12		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_6_HLEN12_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC0_6_HCODE12		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_6_HCODE12_0	(0x1u<<0)

// HUFFENC_AC0_7 Configuration

#define	JPEG_HUFFENC_AC0_7_HLEN15		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_7_HLEN15_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC0_7_HCODE15		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_7_HCODE15_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_7_HLEN14		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_7_HLEN14_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC0_7_HCODE14		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_7_HCODE14_0	(0x1u<<0)

// HUFFENC_AC0_8 Configuration

#define	JPEG_HUFFENC_AC0_8_HLEN17		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_8_HLEN17_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC0_8_HCODE17		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_8_HCODE17_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_8_HLEN16		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_8_HLEN16_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC0_8_HCODE16		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_8_HCODE16_0	(0x1u<<0)

// HUFFENC_AC0_9 Configuration

#define	JPEG_HUFFENC_AC0_9_HLEN19		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_9_HLEN19_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC0_9_HCODE19		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_9_HCODE19_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_9_HLEN18		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_9_HLEN18_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC0_9_HCODE18		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_9_HCODE18_0	(0x1u<<0)

// HUFFENC_AC0_10 Configuration

#define	JPEG_HUFFENC_AC0_10_HLEN21		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_10_HLEN21_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_10_HCODE21		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_10_HCODE21_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_10_HLEN20		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_10_HLEN20_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_10_HCODE20		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_10_HCODE20_0	(0x1u<<0)

// HUFFENC_AC0_11 Configuration

#define	JPEG_HUFFENC_AC0_11_HLEN23		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_11_HLEN23_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_11_HCODE23		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_11_HCODE23_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_11_HLEN22		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_11_HLEN22_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_11_HCODE22		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_11_HCODE22_0	(0x1u<<0)

// HUFFENC_AC0_12 Configuration

#define	JPEG_HUFFENC_AC0_12_HLEN25		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_12_HLEN25_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_12_HCODE25		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_12_HCODE25_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_12_HLEN24		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_12_HLEN24_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_12_HCODE24		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_12_HCODE24_0	(0x1u<<0)

// HUFFENC_AC0_13 Configuration

#define	JPEG_HUFFENC_AC0_13_HLEN27		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_13_HLEN27_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_13_HCODE27		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_13_HCODE27_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_13_HLEN26		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_13_HLEN26_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_13_HCODE26		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_13_HCODE26_0	(0x1u<<0)

// HUFFENC_AC0_14 Configuration

#define	JPEG_HUFFENC_AC0_14_HLEN29		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_14_HLEN29_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_14_HCODE29		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_14_HCODE29_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_14_HLEN28		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_14_HLEN28_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_14_HCODE28		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_14_HCODE28_0	(0x1u<<0)

// HUFFENC_AC0_15 Configuration

#define	JPEG_HUFFENC_AC0_15_HLEN31		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_15_HLEN31_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_15_HCODE31		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_15_HCODE31_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_15_HLEN30		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_15_HLEN30_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_15_HCODE30		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_15_HCODE30_0	(0x1u<<0)

// HUFFENC_AC0_16 Configuration

#define	JPEG_HUFFENC_AC0_16_HLEN33		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_16_HLEN33_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_16_HCODE33		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_16_HCODE33_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_16_HLEN32		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_16_HLEN32_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_16_HCODE32		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_16_HCODE32_0	(0x1u<<0)

