hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
// HUFFENC_AC0_17 Configuration

#define	JPEG_HUFFENC_AC0_17_HLEN35		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_17_HLEN35_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_17_HCODE35		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_17_HCODE35_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_17_HLEN34		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_17_HLEN34_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_17_HCODE34		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_17_HCODE34_0	(0x1u<<0)

// HUFFENC_AC0_18 Configuration

#define	JPEG_HUFFENC_AC0_18_HLEN37		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_18_HLEN37_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_18_HCODE37		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_18_HCODE37_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_18_HLEN36		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_18_HLEN36_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_18_HCODE36		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_18_HCODE36_0	(0x1u<<0)

// HUFFENC_AC0_19 Configuration

#define	JPEG_HUFFENC_AC0_19_HLEN39		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_19_HLEN39_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_19_HCODE39		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_19_HCODE39_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_19_HLEN38		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_19_HLEN38_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_19_HCODE38		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_19_HCODE38_0	(0x1u<<0)

// HUFFENC_AC0_20 Configuration

#define	JPEG_HUFFENC_AC0_20_HLEN41		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_20_HLEN41_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_20_HCODE41		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_20_HCODE41_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_20_HLEN40		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_20_HLEN40_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_20_HCODE40		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_20_HCODE40_0	(0x1u<<0)

// HUFFENC_AC0_21 Configuration

#define	JPEG_HUFFENC_AC0_21_HLEN43		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_21_HLEN43_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_21_HCODE43		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_21_HCODE43_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_21_HLEN42		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_21_HLEN42_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_21_HCODE42		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_21_HCODE42_0	(0x1u<<0)

// HUFFENC_AC0_22 Configuration

#define	JPEG_HUFFENC_AC0_22_HLEN45		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_22_HLEN45_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_22_HCODE45		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_22_HCODE45_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_22_HLEN44		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_22_HLEN44_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_22_HCODE44		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_22_HCODE44_0	(0x1u<<0)

// HUFFENC_AC0_23 Configuration

#define	JPEG_HUFFENC_AC0_23_HLEN47		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_23_HLEN47_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_23_HCODE47		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_23_HCODE47_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_23_HLEN46		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_23_HLEN46_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_23_HCODE46		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_23_HCODE46_0	(0x1u<<0)

// HUFFENC_AC0_24 Configuration

#define	JPEG_HUFFENC_AC0_24_HLEN49		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_24_HLEN49_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_24_HCODE49		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_24_HCODE49_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_24_HLEN48		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_24_HLEN48_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_24_HCODE48		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_24_HCODE48_0	(0x1u<<0)

// HUFFENC_AC0_25 Configuration

#define	JPEG_HUFFENC_AC0_25_HLEN51		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_25_HLEN51_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_25_HCODE51		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_25_HCODE51_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_25_HLEN50		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_25_HLEN50_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_25_HCODE50		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_25_HCODE50_0	(0x1u<<0)

// HUFFENC_AC0_26 Configuration

#define	JPEG_HUFFENC_AC0_26_HLEN53		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_26_HLEN53_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_26_HCODE53		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_26_HCODE53_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_26_HLEN52		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_26_HLEN52_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_26_HCODE52		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_26_HCODE52_0	(0x1u<<0)

// HUFFENC_AC0_27 Configuration

#define	JPEG_HUFFENC_AC0_27_HLEN55		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_27_HLEN55_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_27_HCODE55		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_27_HCODE55_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_27_HLEN54		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_27_HLEN54_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_27_HCODE54		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_27_HCODE54_0	(0x1u<<0)

// HUFFENC_AC0_28 Configuration

#define	JPEG_HUFFENC_AC0_28_HLEN57		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_28_HLEN57_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_28_HCODE57		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_28_HCODE57_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_28_HLEN56		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_28_HLEN56_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_28_HCODE56		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_28_HCODE56_0	(0x1u<<0)

// HUFFENC_AC0_29 Configuration

#define	JPEG_HUFFENC_AC0_29_HLEN59		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_29_HLEN59_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_29_HCODE59		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_29_HCODE59_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_29_HLEN58		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_29_HLEN58_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_29_HCODE58		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_29_HCODE58_0	(0x1u<<0)

// HUFFENC_AC0_30 Configuration

#define	JPEG_HUFFENC_AC0_30_HLEN61		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_30_HLEN61_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_30_HCODE61		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_30_HCODE61_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_30_HLEN60		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_30_HLEN60_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_30_HCODE60		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_30_HCODE60_0	(0x1u<<0)

// HUFFENC_AC0_31 Configuration

#define	JPEG_HUFFENC_AC0_31_HLEN63		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_31_HLEN63_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_31_HCODE63		(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_31_HCODE63_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_31_HLEN62		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_31_HLEN62_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_31_HCODE62		(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_31_HCODE62_0	(0x1u<<0)

