hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
// HUFFENC_AC0_80 Configuration

#define	JPEG_HUFFENC_AC0_80_HLEN161		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_80_HLEN161_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_80_HCODE161	(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_80_HCODE161_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_80_HLEN160		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_80_HLEN160_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_80_HCODE160	(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_80_HCODE160_0	(0x1u<<0)

// HUFFENC_AC0_81 Configuration

#define	JPEG_HUFFENC_AC0_81_HLEN163		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_81_HLEN163_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_81_HCODE163	(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_81_HCODE163_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_81_HLEN162		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_81_HLEN162_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_81_HCODE162	(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_81_HCODE162_0	(0x1u<<0)

// HUFFENC_AC0_82 Configuration

#define	JPEG_HUFFENC_AC0_82_HLEN165		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_82_HLEN165_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_82_HCODE165	(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_82_HCODE165_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_82_HLEN164		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_82_HLEN164_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_82_HCODE164	(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_82_HCODE164_0	(0x1u<<0)

// HUFFENC_AC0_83 Configuration

#define	JPEG_HUFFENC_AC0_83_HLEN167		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_83_HLEN167_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_83_HCODE167	(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_83_HCODE167_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_83_HLEN166		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_83_HLEN166_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_83_HCODE166	(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_83_HCODE166_0	(0x1u<<0)

// HUFFENC_AC0_84 Configuration

#define	JPEG_HUFFENC_AC0_84_HLEN169		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_84_HLEN169_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_84_HCODE169	(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_84_HCODE169_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_84_HLEN168		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_84_HLEN168_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_84_HCODE168	(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_84_HCODE168_0	(0x1u<<0)

// HUFFENC_AC0_85 Configuration

#define	JPEG_HUFFENC_AC0_85_HLEN171		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_85_HLEN171_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_85_HCODE171	(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_85_HCODE171_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_85_HLEN170		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_85_HLEN170_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_85_HCODE170	(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_85_HCODE170_0	(0x1u<<0)

// HUFFENC_AC0_86 Configuration

#define	JPEG_HUFFENC_AC0_86_HLEN173		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_86_HLEN173_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_86_HCODE173	(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_86_HCODE173_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_86_HLEN172		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_86_HLEN172_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_86_HCODE172	(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_86_HCODE172_0	(0x1u<<0)

// HUFFENC_AC0_87 Configuration

#define	JPEG_HUFFENC_AC0_87_HLEN175		(0xFu<<24)
#define	JPEG_HUFFENC_AC0_87_HLEN175_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC0_87_HCODE175	(0xFFu<<16)
#define	JPEG_HUFFENC_AC0_87_HCODE175_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC0_87_HLEN174		(0xFu<<8)
#define	JPEG_HUFFENC_AC0_87_HLEN174_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC0_87_HCODE174	(0xFFu<<0)
#define	JPEG_HUFFENC_AC0_87_HCODE174_0	(0x1u<<0)

// HUFFENC_AC1_0 Configuration

#define	JPEG_HUFFENC_AC1_0_HLEN1		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_0_HLEN1_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC1_0_HCODE1		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_0_HCODE1_0		(0x1u<<16)
#define	JPEG_HUFFENC_AC1_0_HLEN0		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_0_HLEN0_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC1_0_HCODE0		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_0_HCODE0_0		(0x1u<<0)

// HUFFENC_AC1_1 Configuration

#define	JPEG_HUFFENC_AC1_1_HLEN3		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_1_HLEN3_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC1_1_HCODE3		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_1_HCODE3_0		(0x1u<<16)
#define	JPEG_HUFFENC_AC1_1_HLEN2		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_1_HLEN2_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC1_1_HCODE2		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_1_HCODE2_0		(0x1u<<0)

// HUFFENC_AC1_2 Configuration

#define	JPEG_HUFFENC_AC1_2_HLEN5		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_2_HLEN5_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC1_2_HCODE5		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_2_HCODE5_0		(0x1u<<16)
#define	JPEG_HUFFENC_AC1_2_HLEN4		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_2_HLEN4_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC1_2_HCODE4		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_2_HCODE4_0		(0x1u<<0)

// HUFFENC_AC1_3 Configuration

#define	JPEG_HUFFENC_AC1_3_HLEN7		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_3_HLEN7_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC1_3_HCODE7		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_3_HCODE7_0		(0x1u<<16)
#define	JPEG_HUFFENC_AC1_3_HLEN6		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_3_HLEN6_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC1_3_HCODE6		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_3_HCODE6_0		(0x1u<<0)

// HUFFENC_AC1_4 Configuration

#define	JPEG_HUFFENC_AC1_4_HLEN9		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_4_HLEN9_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC1_4_HCODE9		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_4_HCODE9_0		(0x1u<<16)
#define	JPEG_HUFFENC_AC1_4_HLEN8		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_4_HLEN8_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC1_4_HCODE8		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_4_HCODE8_0		(0x1u<<0)

// HUFFENC_AC1_5 Configuration

#define	JPEG_HUFFENC_AC1_5_HLEN11		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_5_HLEN11_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC1_5_HCODE11		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_5_HCODE11_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_5_HLEN10		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_5_HLEN10_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC1_5_HCODE10		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_5_HCODE10_0	(0x1u<<0)

// HUFFENC_AC1_6 Configuration

#define	JPEG_HUFFENC_AC1_6_HLEN13		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_6_HLEN13_0		(0x1u<<24)
#define	JPEG_HUFFENC_AC1_6_HCODE13		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_6_HCODE13_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_6_HLEN12		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_6_HLEN12_0		(0x1u<<8)
#define	JPEG_HUFFENC_AC1_6_HCODE12		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_6_HCODE12_0	(0x1u<<0)

