hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
// HUFFENC_AC1_22 Configuration

#define	JPEG_HUFFENC_AC1_22_HLEN45		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_22_HLEN45_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_22_HCODE45		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_22_HCODE45_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_22_HLEN44		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_22_HLEN44_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_22_HCODE44		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_22_HCODE44_0	(0x1u<<0)

// HUFFENC_AC1_23 Configuration

#define	JPEG_HUFFENC_AC1_23_HLEN47		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_23_HLEN47_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_23_HCODE47		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_23_HCODE47_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_23_HLEN46		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_23_HLEN46_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_23_HCODE46		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_23_HCODE46_0	(0x1u<<0)

// HUFFENC_AC1_24 Configuration

#define	JPEG_HUFFENC_AC1_24_HLEN49		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_24_HLEN49_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_24_HCODE49		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_24_HCODE49_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_24_HLEN48		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_24_HLEN48_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_24_HCODE48		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_24_HCODE48_0	(0x1u<<0)

// HUFFENC_AC1_25 Configuration

#define	JPEG_HUFFENC_AC1_25_HLEN51		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_25_HLEN51_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_25_HCODE51		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_25_HCODE51_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_25_HLEN50		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_25_HLEN50_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_25_HCODE50		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_25_HCODE50_0	(0x1u<<0)

// HUFFENC_AC1_26 Configuration

#define	JPEG_HUFFENC_AC1_26_HLEN53		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_26_HLEN53_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_26_HCODE53		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_26_HCODE53_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_26_HLEN52		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_26_HLEN52_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_26_HCODE52		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_26_HCODE52_0	(0x1u<<0)

// HUFFENC_AC1_27 Configuration

#define	JPEG_HUFFENC_AC1_27_HLEN55		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_27_HLEN55_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_27_HCODE55		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_27_HCODE55_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_27_HLEN54		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_27_HLEN54_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_27_HCODE54		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_27_HCODE54_0	(0x1u<<0)

// HUFFENC_AC1_28 Configuration

#define	JPEG_HUFFENC_AC1_28_HLEN57		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_28_HLEN57_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_28_HCODE57		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_28_HCODE57_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_28_HLEN56		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_28_HLEN56_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_28_HCODE56		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_28_HCODE56_0	(0x1u<<0)

// HUFFENC_AC1_29 Configuration

#define	JPEG_HUFFENC_AC1_29_HLEN59		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_29_HLEN59_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_29_HCODE59		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_29_HCODE59_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_29_HLEN58		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_29_HLEN58_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_29_HCODE58		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_29_HCODE58_0	(0x1u<<0)

// HUFFENC_AC1_30 Configuration

#define	JPEG_HUFFENC_AC1_30_HLEN61		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_30_HLEN61_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_30_HCODE61		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_30_HCODE61_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_30_HLEN60		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_30_HLEN60_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_30_HCODE60		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_30_HCODE60_0	(0x1u<<0)

// HUFFENC_AC1_31 Configuration

#define	JPEG_HUFFENC_AC1_31_HLEN63		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_31_HLEN63_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_31_HCODE63		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_31_HCODE63_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_31_HLEN62		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_31_HLEN62_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_31_HCODE62		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_31_HCODE62_0	(0x1u<<0)

// HUFFENC_AC1_32 Configuration

#define	JPEG_HUFFENC_AC1_32_HLEN65		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_32_HLEN65_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_32_HCODE65		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_32_HCODE65_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_32_HLEN64		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_32_HLEN64_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_32_HCODE64		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_32_HCODE64_0	(0x1u<<0)

// HUFFENC_AC1_33 Configuration

#define	JPEG_HUFFENC_AC1_33_HLEN67		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_33_HLEN67_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_33_HCODE67		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_33_HCODE67_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_33_HLEN66		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_33_HLEN66_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_33_HCODE66		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_33_HCODE66_0	(0x1u<<0)

// HUFFENC_AC1_34 Configuration

#define	JPEG_HUFFENC_AC1_34_HLEN69		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_34_HLEN69_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_34_HCODE69		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_34_HCODE69_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_34_HLEN68		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_34_HLEN68_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_34_HCODE68		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_34_HCODE68_0	(0x1u<<0)

// HUFFENC_AC1_35 Configuration

#define	JPEG_HUFFENC_AC1_35_HLEN71		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_35_HLEN71_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_35_HCODE71		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_35_HCODE71_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_35_HLEN70		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_35_HLEN70_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_35_HCODE70		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_35_HCODE70_0	(0x1u<<0)

// HUFFENC_AC1_36 Configuration

#define	JPEG_HUFFENC_AC1_36_HLEN73		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_36_HLEN73_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_36_HCODE73		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_36_HCODE73_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_36_HLEN72		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_36_HLEN72_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_36_HCODE72		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_36_HCODE72_0	(0x1u<<0)

// HUFFENC_AC1_37 Configuration

#define	JPEG_HUFFENC_AC1_37_HLEN75		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_37_HLEN75_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_37_HCODE75		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_37_HCODE75_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_37_HLEN74		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_37_HLEN74_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_37_HCODE74		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_37_HCODE74_0	(0x1u<<0)

// HUFFENC_AC1_38 Configuration

