hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
#define	JPEG_HUFFENC_AC1_38_HLEN77		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_38_HLEN77_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_38_HCODE77		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_38_HCODE77_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_38_HLEN76		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_38_HLEN76_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_38_HCODE76		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_38_HCODE76_0	(0x1u<<0)

// HUFFENC_AC1_39 Configuration

#define	JPEG_HUFFENC_AC1_39_HLEN79		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_39_HLEN79_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_39_HCODE79		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_39_HCODE79_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_39_HLEN78		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_39_HLEN78_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_39_HCODE78		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_39_HCODE78_0	(0x1u<<0)

// HUFFENC_AC1_40 Configuration

#define	JPEG_HUFFENC_AC1_40_HLEN81		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_40_HLEN81_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_40_HCODE81		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_40_HCODE81_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_40_HLEN80		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_40_HLEN80_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_40_HCODE80		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_40_HCODE80_0	(0x1u<<0)

// HUFFENC_AC1_41 Configuration

#define	JPEG_HUFFENC_AC1_41_HLEN83		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_41_HLEN83_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_41_HCODE83		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_41_HCODE83_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_41_HLEN82		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_41_HLEN82_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_41_HCODE82		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_41_HCODE82_0	(0x1u<<0)

// HUFFENC_AC1_42 Configuration

#define	JPEG_HUFFENC_AC1_42_HLEN85		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_42_HLEN85_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_42_HCODE85		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_42_HCODE85_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_42_HLEN84		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_42_HLEN84_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_42_HCODE84		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_42_HCODE84_0	(0x1u<<0)

// HUFFENC_AC1_43 Configuration

#define	JPEG_HUFFENC_AC1_43_HLEN87		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_43_HLEN87_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_43_HCODE87		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_43_HCODE87_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_43_HLEN86		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_43_HLEN86_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_43_HCODE86		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_43_HCODE86_0	(0x1u<<0)

// HUFFENC_AC1_44 Configuration

#define	JPEG_HUFFENC_AC1_44_HLEN89		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_44_HLEN89_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_44_HCODE89		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_44_HCODE89_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_44_HLEN88		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_44_HLEN88_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_44_HCODE88		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_44_HCODE88_0	(0x1u<<0)

// HUFFENC_AC1_45 Configuration

#define	JPEG_HUFFENC_AC1_45_HLEN91		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_45_HLEN91_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_45_HCODE91		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_45_HCODE91_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_45_HLEN90		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_45_HLEN90_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_45_HCODE90		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_45_HCODE90_0	(0x1u<<0)

// HUFFENC_AC1_46 Configuration

#define	JPEG_HUFFENC_AC1_46_HLEN93		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_46_HLEN93_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_46_HCODE93		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_46_HCODE93_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_46_HLEN92		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_46_HLEN92_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_46_HCODE92		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_46_HCODE92_0	(0x1u<<0)

// HUFFENC_AC1_47 Configuration

#define	JPEG_HUFFENC_AC1_47_HLEN95		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_47_HLEN95_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_47_HCODE95		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_47_HCODE95_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_47_HLEN94		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_47_HLEN94_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_47_HCODE94		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_47_HCODE94_0	(0x1u<<0)

// HUFFENC_AC1_48 Configuration

#define	JPEG_HUFFENC_AC1_48_HLEN97		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_48_HLEN97_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_48_HCODE97		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_48_HCODE97_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_48_HLEN96		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_48_HLEN96_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_48_HCODE96		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_48_HCODE96_0	(0x1u<<0)

// HUFFENC_AC1_49 Configuration

#define	JPEG_HUFFENC_AC1_49_HLEN99		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_49_HLEN99_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_49_HCODE99		(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_49_HCODE99_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_49_HLEN98		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_49_HLEN98_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_49_HCODE98		(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_49_HCODE98_0	(0x1u<<0)

// HUFFENC_AC1_50 Configuration

#define	JPEG_HUFFENC_AC1_50_HLEN101		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_50_HLEN101_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_50_HCODE101	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_50_HCODE101_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_50_HLEN100		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_50_HLEN100_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_50_HCODE100	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_50_HCODE100_0	(0x1u<<0)

// HUFFENC_AC1_51 Configuration

#define	JPEG_HUFFENC_AC1_51_HLEN103		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_51_HLEN103_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_51_HCODE103	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_51_HCODE103_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_51_HLEN102		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_51_HLEN102_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_51_HCODE102	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_51_HCODE102_0	(0x1u<<0)

// HUFFENC_AC1_52 Configuration

#define	JPEG_HUFFENC_AC1_52_HLEN105		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_52_HLEN105_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_52_HCODE105	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_52_HCODE105_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_52_HLEN104		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_52_HLEN104_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_52_HCODE104	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_52_HCODE104_0	(0x1u<<0)

// HUFFENC_AC1_53 Configuration

#define	JPEG_HUFFENC_AC1_53_HLEN107		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_53_HLEN107_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_53_HCODE107	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_53_HCODE107_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_53_HLEN106		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_53_HLEN106_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_53_HCODE106	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_53_HCODE106_0	(0x1u<<0)

// HUFFENC_AC1_54 Configuration

#define	JPEG_HUFFENC_AC1_54_HLEN109		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_54_HLEN109_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_54_HCODE109	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_54_HCODE109_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_54_HLEN108		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_54_HLEN108_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_54_HCODE108	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_54_HCODE108_0	(0x1u<<0)

// HUFFENC_AC1_55 Configuration

#define	JPEG_HUFFENC_AC1_55_HLEN111		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_55_HLEN111_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_55_HCODE111	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_55_HCODE111_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_55_HLEN110		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_55_HLEN110_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_55_HCODE110	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_55_HCODE110_0	(0x1u<<0)

// HUFFENC_AC1_56 Configuration

#define	JPEG_HUFFENC_AC1_56_HLEN113		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_56_HLEN113_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_56_HCODE113	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_56_HCODE113_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_56_HLEN112		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_56_HLEN112_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_56_HCODE112	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_56_HCODE112_0	(0x1u<<0)

// HUFFENC_AC1_57 Configuration

