hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_jpeg.h
#define	JPEG_HUFFENC_AC1_57_HLEN115		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_57_HLEN115_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_57_HCODE115	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_57_HCODE115_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_57_HLEN114		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_57_HLEN114_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_57_HCODE114	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_57_HCODE114_0	(0x1u<<0)

// HUFFENC_AC1_58 Configuration

#define	JPEG_HUFFENC_AC1_58_HLEN117		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_58_HLEN117_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_58_HCODE117	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_58_HCODE117_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_58_HLEN116		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_58_HLEN116_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_58_HCODE116	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_58_HCODE116_0	(0x1u<<0)

// HUFFENC_AC1_59 Configuration

#define	JPEG_HUFFENC_AC1_59_HLEN119		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_59_HLEN119_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_59_HCODE119	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_59_HCODE119_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_59_HLEN118		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_59_HLEN118_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_59_HCODE118	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_59_HCODE118_0	(0x1u<<0)

// HUFFENC_AC1_60 Configuration

#define	JPEG_HUFFENC_AC1_60_HLEN121		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_60_HLEN121_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_60_HCODE121	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_60_HCODE121_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_60_HLEN120		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_60_HLEN120_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_60_HCODE120	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_60_HCODE120_0	(0x1u<<0)

// HUFFENC_AC1_61 Configuration

#define	JPEG_HUFFENC_AC1_61_HLEN123		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_61_HLEN123_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_61_HCODE123	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_61_HCODE123_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_61_HLEN122		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_61_HLEN122_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_61_HCODE122	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_61_HCODE122_0	(0x1u<<0)

// HUFFENC_AC1_62 Configuration

#define	JPEG_HUFFENC_AC1_62_HLEN125		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_62_HLEN125_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_62_HCODE125	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_62_HCODE125_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_62_HLEN124		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_62_HLEN124_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_62_HCODE124	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_62_HCODE124_0	(0x1u<<0)

// HUFFENC_AC1_63 Configuration

#define	JPEG_HUFFENC_AC1_63_HLEN127		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_63_HLEN127_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_63_HCODE127	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_63_HCODE127_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_63_HLEN126		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_63_HLEN126_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_63_HCODE126	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_63_HCODE126_0	(0x1u<<0)

// HUFFENC_AC1_64 Configuration

#define	JPEG_HUFFENC_AC1_64_HLEN129		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_64_HLEN129_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_64_HCODE129	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_64_HCODE129_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_64_HLEN128		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_64_HLEN128_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_64_HCODE128	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_64_HCODE128_0	(0x1u<<0)

// HUFFENC_AC1_65 Configuration

#define	JPEG_HUFFENC_AC1_65_HLEN131		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_65_HLEN131_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_65_HCODE131	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_65_HCODE131_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_65_HLEN130		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_65_HLEN130_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_65_HCODE130	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_65_HCODE130_0	(0x1u<<0)

// HUFFENC_AC1_66 Configuration

#define	JPEG_HUFFENC_AC1_66_HLEN133		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_66_HLEN133_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_66_HCODE133	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_66_HCODE133_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_66_HLEN132		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_66_HLEN132_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_66_HCODE132	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_66_HCODE132_0	(0x1u<<0)

// HUFFENC_AC1_67 Configuration

#define	JPEG_HUFFENC_AC1_67_HLEN135		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_67_HLEN135_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_67_HCODE135	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_67_HCODE135_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_67_HLEN134		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_67_HLEN134_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_67_HCODE134	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_67_HCODE134_0	(0x1u<<0)

// HUFFENC_AC1_68 Configuration

#define	JPEG_HUFFENC_AC1_68_HLEN137		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_68_HLEN137_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_68_HCODE137	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_68_HCODE137_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_68_HLEN136		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_68_HLEN136_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_68_HCODE136	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_68_HCODE136_0	(0x1u<<0)

// HUFFENC_AC1_69 Configuration

#define	JPEG_HUFFENC_AC1_69_HLEN139		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_69_HLEN139_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_69_HCODE139	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_69_HCODE139_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_69_HLEN138		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_69_HLEN138_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_69_HCODE138	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_69_HCODE138_0	(0x1u<<0)

// HUFFENC_AC1_70 Configuration

#define	JPEG_HUFFENC_AC1_70_HLEN141		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_70_HLEN141_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_70_HCODE141	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_70_HCODE141_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_70_HLEN140		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_70_HLEN140_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_70_HCODE140	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_70_HCODE140_0	(0x1u<<0)

// HUFFENC_AC1_71 Configuration

#define	JPEG_HUFFENC_AC1_71_HLEN143		(0xFu<<24)
#define	JPEG_HUFFENC_AC1_71_HLEN143_0	(0x1u<<24)
#define	JPEG_HUFFENC_AC1_71_HCODE143	(0xFFu<<16)
#define	JPEG_HUFFENC_AC1_71_HCODE143_0	(0x1u<<16)
#define	JPEG_HUFFENC_AC1_71_HLEN142		(0xFu<<8)
#define	JPEG_HUFFENC_AC1_71_HLEN142_0	(0x1u<<8)
#define	JPEG_HUFFENC_AC1_71_HCODE142	(0xFFu<<0)
#define	JPEG_HUFFENC_AC1_71_HCODE142_0	(0x1u<<0)

// HUFFENC_AC1_72 Configuration

